using System;
using System.Net;
using System.Windows;
using System.Windows.Controls;
using System.Windows.Documents;
using System.Windows.Ink;
using System.Windows.Input;
using System.Windows.Media;
using System.Windows.Media.Animation;
using System.Windows.Shapes;
using System.Collections.Generic;

namespace SiChi.Model
{
    public static class TestData
    {
        //随机获取4个跟length长度一样的字符串
        public static List<string> GetFourData(int length)
        {
            List<string> result = null;
            switch (length)
            { 
                case 4:
                    result = GetFourNotCorrputed(_fourContent);
                    break;
                case 5:
                    result = GetFourNotCorrputed(_fiveContent);
                    break;
                case 6:
                    result = GetFourNotCorrputed(_sixContent);
                    break;
                case 7:
                    result = GetFourNotCorrputed(_sevenContent);
                    break;
            }

            return result;
        }

        private static List<string> GetFourNotCorrputed(string[] content)
        {
            Random rand = new Random(DateTime.Now.Millisecond);
            List<string> result = new List<string>();
            List<int> numberArray = new List<int>();
            int number;

            
            while (numberArray.Count != 4)
            {
                number = rand.Next(content.Length);
                if (numberArray.BinarySearch(number) < 0)
                    numberArray.Add(number);
            }

            foreach (int i in numberArray)
                result.Add(content[i]);

            return result;
        }

        static string[] _fourContent = {"东临碣石","以观沧海","水何澹澹","山岛竦峙","树木丛生","百草丰茂","秋风萧瑟","洪波涌起","日月之行","若出其中"
                                        ,"星汉灿烂","若出其里","幸甚至哉","歌以咏志","神龟虽寿","尤有竟时","腾蛇乘雾","终为土灰","老骥伏枥","志在千里"
                                        ,"烈士暮年","壮心不已","盈缩之期","不但在天","养怡之福","可得永年","幸甚至哉","歌以咏志","对酒当歌","人生几何"
                                       ,"譬如朝露","去日苦多","慨当以慷","忧思难忘","何以解忧","唯有杜康","青青子衿","悠悠我心","但为君故","沈吟至今"
                                       ,"呦呦鹿鸣","食野之萍","我有嘉宾","鼓瑟吹笙","明明如月","何时可掇","忧从中来","不可断绝","越陌度阡","枉用相存"
                                       ,"契阔谈宴","心念旧恩","月明星稀","乌鹊南飞","绕树三匝","何枝可依","山不厌高","海不厌深","周公吐哺","天下归心"
                                       ,"翩翩黄鸟","雌雄相依","念我之独","谁其与归","霭霭停云","濛濛时雨","八表同昏","平路伊阻","静寄东轩","春醪独抚"
                                       ,"良朋悠邈","搔首延伫","停云霭霭","时雨濛濛","八表同昏","平陆成江","有酒有酒","闲饮东窗","愿言怀人","舟车靡从"
                                       ,"东园之树","枝条载荣","竞用新好","以怡余情","人亦有言","日月于征","安得促席","说彼平生","翩翩飞鸟","息我庭柯"
                                       ,"敛翮闲止","好声相和","岂无他人","念子实多","愿言不获","抱恨如何","迈迈时运","穆穆良朝","袭我春服","薄言东郊"
                                       ,"山涤余霭","宇暧微霄","有风自南","翼彼新苗","洋洋平泽","乃漱乃濯","邈邈遐景","载欣载瞩","人亦有言","称心易足"
                                       ,"挥兹一觞","陶然自乐","延目中流","悠想清沂","童冠齐业","闲咏以归","我爱其静","寤寐交挥","但恨殊世","邈不可追"
                                       ,"斯晨斯夕","言息其庐","花药分列","林竹翳如","清琴横床","浊酒半壶","黄唐莫逮","慨独在余","采采荣木","结根于兹"
                                       ,"晨耀其华","夕已丧之","人生若寄","憔悴有时","静言孔念","中心怅而","采采荣木","于兹托根","繁华朝起","慨暮不存"
                                       ,"贞脆由人","祸福无门","匪道曷依","匪善奚敦","嗟予小子","禀兹固陋","徂年既流","业不增旧","志彼不舍","安此日富"
                                       ,"我之怀矣","怛焉内疚","先师遗训","余岂之坠","四十无闻","斯不足畏","脂我名车","策我名骥","千里虽遥","孰敢不至"
                                       ,"蒹葭苍苍","白露为霜","所谓伊人","在水一方","溯洄从之","道阻且长","溯游从之","静女其姝","爱而不见","搔首踟蹰"
                                       ,"静女其娈","贻我彤管","彤管有炜","说怿女美","自牧归荑","洵美且异","美人之贻"};
        static string[] _fiveContent = {"海日生残夜","江春入旧年","待到重阳日","还来就菊花","清晨入古寺","初日照高林","曲径通幽处","禅房花木深","绿树村边合","青山郭外斜",
                                       "山际见来烟","竹中窥落日","鸟向檐上飞","云从窗里出","独坐幽篁里","弹琴复长啸","深林人不知","明月来相照","造化钟神秀","阴阳割昏晓",
                                       "会当凌绝顶","一览众山小","国破山河在","城春草木深","感时花溅泪","恨别鸟惊心","烽火连三月","家书抵万金","白头搔更短","浑欲不胜簪",
                                       "月下飞天镜","云生结海楼","仍怜故乡水","万里送行舟","阳春布德泽","万物生光辉","少壮不努力","老大徒伤悲","迷津欲有问","平海夕漫漫",
                                       "采菊东篱下","悠然见南山","山气日夕佳","飞鸟相与还","此中有真意","欲辨已忘言","前不见古人","后不见来者","田家少闲月","五月人倍忙",
                                       "吏禄三百石","岁晏有余粮","念此私自愧","尽日不能忘","牙璋辞凤阙","铁骑绕龙城","雪暗凋旗画","风多杂鼓声","举杯邀明月","对影成三人",
                                       "月既不解饮","影徒随我身","暂伴月将影","行乐须及春","水是眼波横","山是眉峰聚","嗳嗳远人村","依依墟里烟","狗吠深巷中","鸡鸣桑树颠",
                                       "空山新雨后","天气晚来秋","明月松间照","清泉石上流","竹喧归浣女","莲动下渔舟","随意春芳歇","王孙自可留","君自故乡来","应知故乡事",
                                       "来日绮窗前","寒梅著花未","大野始严凝","云天晓色澄","树寒稀宿鸟","山迥少来僧","背日收窗雪","开炉释砚冰","忽然归故国","孤想寓西陵",
                                       "故国遗墟在","登临想旧游","一朝人事变","千载水空流","梦渚鸿声晚","荆门树色秋","片云凝不散","遥挂望乡愁","秋空明月悬","光彩露沾湿",
                                       "惊鹊栖未定","飞萤卷帘入","庭槐寒影疏","邻杵夜声急","佳期旷何许","望望空伫立","秦地罗敷女","采桑绿水边","素手青条上","红妆白日鲜",
                                       "蚕饥妾欲去","五马莫留连","镜湖三百里","菡萏发荷花","五月西施采","人看隘若耶","回舟不待月","归去越王家","长安一片月","万户擣衣声",
                                       "秋风吹不尽","总是玉关情","何日平胡虏","良人罢远征","明月出天山","苍茫云海间","长风几万里","吹度玉门关","汉下白登道","胡窥青海湾",
                                       "由来征战地","不见有人还","戍客望边色","思归多苦颜","高楼当此夜","叹息未应闲"};
        static string[] _sixContent = {"无明略以佐时","徒临川以羡鱼","俟河清乎未期","感蔡子之慷慨","从唐生以决疑","谅天道之微昧","追渔父以同嬉","超尘埃以远逝","与世事乎长辞","感平生之游处", 
                                "若埙篪之相须","何今日之两绝","若胡越之异区","顺笼槛以俯仰","窥户牖以踟躇","想昆山之高岳","思邓林之扶疏","顾六翮之残毁","虽奋迅其焉如","心怀归而弗果",
                                "徒怨毒于一隅","苟竭心于所事","敢背惠而忘初","托轻鄙之微命","委陋贱之薄躯","期守死以报德","甘尽辞以效愚","恃隆恩于既往","庶弥久而不渝","日月既逝西藏",
                                "更会兰室洞房","华灯步障舒光","皎若日出扶桑","促樽合坐行觞","主人起舞娑盘","能者穴触别端","腾觚飞爵阑干","同量等色齐颜","任意交属所欢","朱颜发外形兰",
                                "袖随礼容极情","妙舞仙仙体轻","裳解履遗绝缨","俯仰笑喧无呈","览持佳人玉颜","齐举金爵翠盘","手形罗袖良难","腕若不胜珠环","坐者叹息舒颜","御巾糦粉君傍",
                                "中有霍纳都梁","鸡舌五味杂香","进者何人齐姜","恩重爱深难忘","召延亲好宴私","但歌杯来何迟","客赋既醉言归","江南江北愁望","相思相忆空吟","鸳鸯暖卧沙浦",
                                "砠矦闲飞桔林","烟里歌声隐隐","渡头月色沉沉","含情咫尺千里","况听家家远砧","从洛到许巍巍","曹公忧国无私","减去厨膳甘肥","羣僚率从祁祁","虽得俸禄常饥",
                                "念我苦寒心悲","清溪落日初低","惆怅孤舟解携","鸟向平芜远近","人随流水东西","白云千里万里","明月前溪后溪","惆怅长沙谪去","江潭芳草萋萋","扬州桥边小妇",
                                "长干城里商人","三年不得消息","各自拜鬼求神","青草湖边草色","飞猿岭上猿声","万里三湘客到","有风有雨人行"};
        static string[] _sevenContent = {"秋风萧瑟天气凉","草木摇落露为霜","群燕辞归雁南翔","念君客游思断肠","慊慊思归恋故乡","何为淹留寄他方","贱妾茕茕守空房","忧来思君不能忘","不觉泪下沾衣裳","援琴鸣弦发清商",
                                "短歌微吟不能长","明月皎皎照我床","星汉西流夜未央","牵牛织女遥相望","尔独何辜限河梁","闲窥石镜清我心","谢公行处苍苔没","人生在世不称意","明朝散发弄扁舟","手把芙蓉朝玉京",
                                "早服还丹无世情","琴心三叠道初成","长风万里送秋雁","对此可以酣高楼","蓬莱文章建安骨","中间小谢又清发","俱怀逸兴壮思飞","欲上青天揽明月","抽刀断水水更流","举杯销愁愁更愁",
                                "遥见仙人彩云里","先期汗漫九垓上","愿接卢敖游太清","西山白雪三城戍","南浦清江万里桥","海内风尘诸弟隔","天涯涕泪一身遥","惟将迟暮供多病","未有涓埃答圣朝","跨马出郊时极目",
                                "不堪人事日萧条","剑外忽传收蓟北","初闻涕泪满衣裳","却看妻子愁何在","漫卷诗书喜欲狂","白日放歌须纵酒","青春作伴好还乡","两个黄鹂鸣翠柳","一行白露上青天","窗含西岭千秋雪",
                                "门泊东吴万里船","即从巴峡穿巫峡","便下襄阳向洛阳","三万里河东人海","五千仍岳上摩天","遗民泪尽胡尘里","南望王师又一年","落魄江湖载酒行","楚腰纤细掌中轻","十年一觉扬州梦",
                                "赢得青楼薄幸名","瑶池阿母绮窗开","黄竹歌声动地哀","八骏日行三万里","穆王何事不重来","岁岁金河复玉关","朝朝马策与刀环","三春白雪归青冢","万里黄河绕黑山","青山隐隐水迢迢",
                                "秋尽江南草未凋","二十四桥明月夜","玉人何处教吹箫","朝辞白帝彩云间","千里江陵一日还","两岸猿声啼不住","轻舟已过万重山","楼上残灯伴晓霜","独眠人起合欢床","相思一夜情多少",
                                "地角天涯不是长","去年今日此门中","人面桃花相映红","人面不知何处去","桃花依旧笑春风","多情却似总无情","唯觉樽前笑不成","蜡烛有心还惜别","替人垂泪到天明","别梦依依到谢家",
                                "小廊回合曲阑斜","多情只有春庭月","犹为离人照落花","水纹珍簟思悠悠","千里佳期一夕休","从此无心爱良夜","任他明月下西楼","公子王孙逐后尘","绿珠垂泪滴罗巾","侯门一入深似海",
                                "从此萧郎是路人","云想衣裳花想容","春风拂槛露华浓","若非群玉山头见","会向瑶台月下逢","一枝秾艳露凝香","云雨巫山枉断肠","借问汉宫谁得似","可怜飞燕倚新妆","名花倾国两相欢",
                                "常得君王带笑看","解释春风无限恨","沉香亭北倚阑干","五岳寻仙不辞远","一生好入名山游","庐山秀出南斗傍","屏风九叠云锦张","影落明湖青黛光","金阙前开二峰长","银河倒挂三石梁",
                                "香炉瀑布遥相望","回崖沓障凌苍苍","翠影红霞映朝日","鸟飞不到吴天长","登高壮观天地间","大江茫茫去不还","黄云万里动风色","白波九道流雪山","闲窥石镜清我心","谢公行处苍苔没",
                                "早服还丹无世情","琴心三叠道初成","遥见仙人彩云里","手把芙蓉朝玉京","先期汗漫九垓上","愿接卢敖游太清","长风万里送秋雁","对此可以酣高楼","蓬莱文章建安骨","中间小谢又清发",
                                "俱怀逸兴壮思飞","欲上青天揽明月","抽刀断水水更流","举杯消愁愁更愁","人生在世不称意","明朝散发弄扁舟","尔来四万八千岁","不与秦塞通人烟","西当太白有鸟道","可以横绝峨眉巅",
                                "扪参历井仰胁息","以手抚膺坐长叹","问君西游何时还","畏途巉岩不可攀","人生得意须尽欢","莫使金樽空对月","天生我材必有用","千金散尽还复来","烹羊宰牛且为乐","会须一饮三百杯",
                                "钟鼓馔玉不足贵","但愿长醉不愿醒","古来圣贤皆寂寞","惟有饮者留其名","陈王昔时宴平乐","斗酒十千恣欢谑","主人何为言少钱","径须沽取对君酌","呼儿将出换美酒","与尔同销万古愁"};
    }
}
